// CREAT BY 吴兴省    13127952680
//=======================================

//功能：首页搜索框
//=======================================
//当鼠标点击时，如果为默认值则清空
function clearThis(obj) {  
    if ($(obj).val() == "请输入您要搜索的关键字") {       
        $(obj).val("");
    }
}
//当鼠标离开时，如果为空则赋值为默认值
function assignmentVal(obj) {
    if ($(obj).val() == "") {
        $(obj).val("请输入您要搜索的关键字");
    }
}
//=======================================
//功能：首页主导航点击增加状态
//=======================================
//当鼠标点击时，首页主导航点击增加状态
function addState(obj) {
    $(obj).addClass("on");
    $(obj).parent().siblings().find("a").removeClass();
}